Австралия/src/Documents/ProductionTask/ProductionTask.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductionTask</name>
  <basedOn>Document.ManufacturingOperation</basedOn>
  <registerRecords>AccumulationRegister.ProductionAccomplishment</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.ManufacturingOperation</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ProductionTaskStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Operation</name>
    <type>
      <types>CatalogRef.ManufacturingActivities</types>
    </type>
  </attributes>
  <attributes>
    <name>ConnectionKey</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OperationQuantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Output</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>StandardTimeInUOM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TimeUOM</name>
    <type>
      <types>CatalogRef.TimeUOM</types>
    </type>
  </attributes>
  <attributes>
    <name>StandardTime</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StartDatePlanned</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>EndDatePlanned</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkcenterType</name>
    <type>
      <types>CatalogRef.CompanyResourceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Workcenter</name>
    <type>
      <types>CatalogRef.CompanyResources</types>
    </type>
  </attributes>
  <attributes>
    <name>Assignee</name>
    <type>
      <types>CatalogRef.Teams</types>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>ComponentsList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ParentTask</name>
    <type>
      <types>DocumentRef.ProductionTask</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Inventory</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Documents/ProductionTask/Forms/AssignForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ProductionTasksArray = New Array;
	Parameters.Property("ProductionTasksArray", ProductionTasksArray);
	
	ProductionTasks.LoadValues(ProductionTasksArray);
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	FormManagement();
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure TypeIsTeamOnChange(Item)
	
	FormManagement();
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure Assign(Command)
	
	If TypeIsTeam And Not ValueIsFilled(Team) Then
		
		CommonClientServer.MessageToUser(NStr("en = 'Specify a team.'; ru = 'Укажите бригаду.';pl = 'Określ zespół.';es_ES = 'Especificar un equipo.';es_CO = 'Especificar un equipo.';tr = 'Takım belirtin.';it = 'Specificare un team.';de = 'Ein Team angeben.'"), , "Team");
		
	ElsIf Not TypeIsTeam And Not ValueIsFilled(Employee) Then
		
		CommonClientServer.MessageToUser(NStr("en = 'Specify an employee.'; ru = 'Укажите сотрудника.';pl = 'Określ pracownika.';es_ES = 'Especificar un empleado.';es_CO = 'Especificar un empleado.';tr = 'Çalışan belirtin.';it = 'Specificare un dipendente.';de = 'Einen Mitarbeiter angeben.'"), , "Employee");
		
	Else
		
		If AssignTasks(ProductionTasks.UnloadValues(), ?(TypeIsTeam, Team, Employee)) Then
			
			For Each TaskLine In ProductionTasks Do
				Notify("EmployeeChanged", TaskLine.Value);
				NotifyChanged(TaskLine.Value);
			EndDo;
			
			Close();
			
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure FormManagement()
	
	Items.Team.Visible = TypeIsTeam;
	Items.Employee.Visible = Not TypeIsTeam;
	
EndProcedure

&AtServerNoContext
Function AssignTasks(ProductionTasksArray, Assignee)
	
	Result = True;
	
	For Each ProductionTaskRef In ProductionTasksArray Do
		
		ProductionTask = ProductionTaskRef.GetObject();
		ProductionTask.Assignee = Assignee;
		
		Try
			
			ProductionTask.Write();
			
		Except
			
			Result = False;
			DriveClientServer.ProductionTasksErrorMessage(ProductionTaskRef);
			
		EndTry;
		
	EndDo;
	
	Return Result;
	
EndFunction

#EndRegion
